mod-4-proj-music-api/app/controllers/api/v1/playlists_controller.rb

  def create
    @playlist = Playlist.create(playlist_params)
---
INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["user_id", 2], ["created_at", "2019-01-23 15:32:42.265959"], ["updated_at", "2019-01-23 15:32:42.265959"]]