mod-4-proj-music-api/app/controllers/api/v1/playlist_tracks_controller.rb

SELECT "playlist_tracks".* FROM "playlist_tracks"
SELECT "tracks".* FROM "tracks"
---
    def index
      @playlist_tracks = PlaylistTrack.all

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."spotify_id" = $1 LIMIT $2  [["spotify_id", "37xLpW0AsrZsj5Wts3ACji"], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tracks" ("name", "artists", "image", "duration", "popularity", "preview", "spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "playlist_tracks" ("track_id", "playlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["track_id", 5], ["playlist_id", 3], ["created_at", "2019-01-23 18:53:54.670284"], ["updated_at", "2019-01-23 18:53:54.670284"]]
---
    def create
      # byebug
      # see if this track exists in the db
      track = Track.find_by(spotify_id: params[:spotify_id])
      # byebug
      # unless !track
      if !track
        # find the spotify song from the api
        s_track = RSpotify::Track.find(params[:spotify_id])
        # create a new track
        track = Track.create_from_spotify_track(s_track)
      end

      @playlist_track = PlaylistTrack.create(playlist_id: playlist_track_params[:playlist_id], track_id: track.id)