mod-4-proj-music-api/app/models/track.rb

INSERT INTO "tracks" ("name", "artists", "image", "duration", "popularity", "preview", "spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def self.create_from_spotify_track(spotify_track)
    track = self.new_from_spotify_track(spotify_track)
    track.save